<template>
  <main>
    <h1>تعرف علينا</h1>
    <p class="about-text">
      النادي السينمائي السوري هو في الأساس منصة رقمية أسسها ويُديرها شباب وشابات
      متطوعون ومدفوعون بحب السينما والشغف بعالم الأفلام المسلسلات التي تحمل معنى
      وقيمة كبيرين.
    </p>

    <p class="about-text">
      إن النادي السينمائي السوري عبارة عن جهد مشترك يهدف إلى بناء مجتمع سينمائي
      كبير وزيادة الوعي السينمائي داخل سورية على وجه الخصوص وضمن العالم العربي
      على وجه العموم، وذلك عن طريق منصة خاصة تُعنى بطرح وتقييم أهم ما أنتجته
      الصناعة السينمائية في شتى أرجاء العالم.
    </p>

    <p class="about-text">
      لا يكتفي النادي السينمائي السوري بالعمل الرقمي وحسب، بل يحاول جاهداً نقل
      التجربة السينمائي على أرض الواقع عن طريق إنشاء فعاليات سينمائية ضمن العديد
      من المدن السورية، أملاً منا بتطوير المفهوم السينمائي العام في سورية.
    </p>

    <p class="about-text">
      تأسس هذا النادي كمنصة رقمية في عام 2016 على يد المرحوم فيصل عبد اللطيف،
      الذي كان يملك شغفاً هائلاً وعشقاً كبيراً تجاه عالم السينما بكل تفاصيله.
      أراد فيصل نقل هذا الشغف إلى أكبر قدر مستطاع من الجمهور، ليلهمهم بما رآه
      بأنه عالم آخر يُدفع فيه المرء نحو تجربة فنية تأسر كلاً من عقله ولبه في
      جمال قلّما يمكن تكراره.
    </p>

    <h2>هدف هذا الموقع</h2>
    <p class="about-text">
      هذا الموفع عبارة عن تطبيق بسيط على شبكة الإنترنت يهدف إلى مشاركة اقتباسات
      جميلة وطريفة قيلت على لسان شخصيات مشهورة بعالم الأفلام أو المسلسلات، وعرض
      معلومات أساسية عن ذلك الفيلم أو المسلسل.
    </p>

    <p class="about-text">
      تظهر هذه <a href="/quotes.json" target="__blank">الاقتباسات</a> عشوائياً
      من خلال قاعدة بيانات لها موجودة ضمن هيكلية الموقع نفسه، بينما تأتي
      المعلومات عن طريق قواعد بيانات شبكة
      <a href="https://imdb-api.com/" target="__blank">IMDb</a> على الإنترنت.
      لذا جميع المعلومات التي تظهر على الموقع والخاصة بالفيلم أو المسلسل، هي
      مأخوذة بشكل مباشرة من شبكة IMDb العالمية، وليست مكتوبة من قبل أحد القائمين
      على هذا الموقع. كما يمكن البحث بشكل منفصل عن عمل ما لإظهار المعلومات
      الأساسية المتعلقة به.
    </p>

    <p class="about-text" id="landing-phrase">
      معظم هذه الاقتباسات هي باللغة الإنكليزية بطبيعة الحال، لكون اللغة
      الإنلكيزية هي اللغة الأكثر انتشاراً في الأفلام والمسلسلات العالمية، لكن
      يمكن أن تتواجد اقتباسات باللغة العربية أو غيرها من اللغات.
    </p>

    <p class="about-text">
      أما الهيكلية الأساسية لهذه الاقتباسات فهي كالتالي:
      <br />
      . جهة الاقتباس (إما من فيلم أو من مسلسل)
      <br />
      . لغة الاقتباسات
      <br />
      . اسم الفيلم أو المسلسل المأخوذ منه الاقتباس
      <br />
      . الاقتباس نفسه
      <br />
      . اسم الشخصية القائلة لهذا الاقتباس
    </p>

    <p class="about-text">
      بينما المعلومات الأساسية المتعلفة بالفيلم أو المسلسل فهي كالتالي:
      <br />
      . اسم العمل
      <br />
      . المدة الزمنية لمشاهدة العمل
      <br />
      . تصنيف العمل (دراما، أكشن، خيال علمي، إلخ...)
      <br />
      . اسم المخرج (للأفلام فقط)
      <br />
      . اسم الكاتب (لأفلام فقط)
      <br />
      . العمر المناسب الذي يُنصح به لمشاهدة العمل
      <br />
      . تقييم العمل على شبكة IMDb
      <br />
      . تاريخ صدور العمل في دور السينما الأمريكية
      <br />
      . البلد/البلدان التي أنتج بها بالعمل
      <br />
      . الجوائز العالمية التي حصل عليها (مع ترتيبه ضمن قائمة أعلى 250 عمل
      تقييماً على شبكة IMDb في حال كان ضمن القائمة)
    </p>

    <p class="about-text">
      يمكنكم أنتم أيضاً المشاركة في إثراء الاقتباسات الموجودة ضمن الموقع، عبر
      مشاركة اقتباساتكم المفضلة من خلال تعبئة
      <a href="/contact#landing-phrase">النموذج</a> الخاص بالنادي، وفق هيكلية
      الاقتباسات السابقة. كما نتمنى أيضاً مشاركة تعليقاتكم وآرائكم حيال الموقع
      والاقتراحات بتحسينه. نأمل أن يكون هذا الموقع مفيدأ ومسلياً لكم.
    </p>

    <p class="about-text">
      <em> للانتقال إلى صفحة سياسة الخصوصية، اضفط على الرابط التالي: </em>
      <br />
      <router-link to="/privacy-policy">
        <em> سياسة الخصوصية | Privacy Policy </em>
      </router-link>
    </p>
  </main>
</template>

<style scoped>
h1 {
  margin: 2rem;
  direction: rtl;
  font-family: "Tajawal", sans-serif;
}

h2 {
  margin-top: 4rem;
  margin-right: 2rem;
  direction: rtl;
  font-family: "Tajawal", sans-serif;
  color: hsl(46, 98%, 50%);
}

a {
  color: hsl(39, 98%, 50%);
}

.about-text {
  margin: 2rem;
  direction: rtl;
  font-family: "Tajawal", sans-serif;
  font-weight: 500;
  text-align: justify;
  line-height: 1.6;
  color: #2c3e50;
}

@media screen and (min-width: 1024px) {
  h1 {
    margin: 2rem 0;
  }

  h2 {
    margin-right: 12rem;
  }

  .about-text {
    margin: 2rem 12rem;
  }
}

@media (prefers-color-scheme: dark) {
  .about-text {
    color: #fafafa;
  }
}
</style>
